# -*- coding: utf-8 -*-

# (цикл while)

# даны целые положительные числа a и b (a > b)
# Определить результат целочисленного деления a на b, с помощью цикла while,
# __НЕ__ используя ни одной из операций деления: ни деления с плавающей точкой /, ни целочисленного деления //
# и взятия остатка %
# Формат вывода:
#   Целочисленное деление ХХХ на YYY дает ZZZ

a, b = 4, 2
n_iter = 0
res = a
while res>=0:
    n_iter +=1
    res-= b
print('Целочисленное деление {} на {} дает {}'.format(a, b, n_iter-1))
# зачет!