# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000

cost_of_living = expenses
cost_of_living_temp = expenses
i = 1
while i<=9:
    cost_of_living_temp *=1.03
    cost_of_living += cost_of_living_temp
    i+=1

print(f'Студенту надо попросить {cost_of_living - educational_grant * 10} рублей')


# зачет!