# модуль хранит функции ингридиентов для пригтовления бургера

def bulochka():
    return 'Возьмем карамелизованную булочку'

def kotlety():
    return 'А теперь добавим рубленый бифштекс'

def ogurchik():
    return 'А теперь добавим маринованный огурчик'

def pomidorka():
    return 'А теперь добавим помидорчик'

def gorchitsa():
    return 'А теперь добавим горчицу'

def sir():
    return 'А теперь добавим сыр Чеддер'

def ketchup():
    return 'А теперь добавим майонез'

def luk():
    return 'А теперь добавим лук'