#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Батя', 'Маман', 'Братишка']


# список списков приблизительного роста членов вашей семьи
my_family_height = [
    # ['имя', рост],
    ['Батя' , 178], ['Маман' , 166], ['Братишка' , 185]
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
print(f'Рост отца - {my_family_height[my_family.index("Батя")][1]} см')

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
print(f'Общий рост моей семьи - {sum(i[1] for i in my_family_height)} см')
# зачет!